<template>
  <div class="tab2">
    <h2>我是美文欣赏</h2>
    <div class="tab2-content" ref="tab2-content">
      <p>
        在川湘交界的茶峒附近，小溪白塔旁边，住着主人公翠翠和她爷爷老船夫。茶峒城里有个船总叫顺顺，他有两个儿子，老大叫天保，老二叫傩送。
        端午节翠翠去看龙舟赛，偶然相遇相貌英俊的青年水手傩（nuó）送，傩送在翠翠的心里留下了深刻的印象。同时，傩送的兄长天保也喜欢上了翠翠，并提前托媒人提了亲。天保告诉傩送一年前他就爱上了翠翠，而傩送告诉天保他两年前就爱上了翠翠，天保听了后也吃了一惊。然而此时，当地的团总以新磨坊为陪嫁，想把女儿许配给傩送。而傩送宁肯继承一条破船也要与翠翠成婚。
        兄弟俩没有按照当地风俗以决斗论胜负，而是采用公平而浪漫的唱山歌的方式表达感情，让翠翠自己从中选择。傩送是唱歌好手，天保自知唱不过弟弟，心灰意冷，断然驾船远行做生意。
        碧溪边只听过一夜傩送的歌声，后来，歌却再没有响起来。老船夫忍不住去问，本以为是老大唱的，却得知：唱歌人是傩送，老大讲出实情后便去做生意。几天后老船夫听说老大坐水船出了事，淹死了……
        码头的船总顺顺因为儿子天保的死对老船夫变得冷淡。船总顺顺不愿意翠翠再做傩送的媳妇。老船夫只好郁闷地回到家，翠翠问他，他也没说起什么。夜里下了大雨，夹杂着吓人的雷声。第二天翠翠起来发现船已被冲走，屋后的白塔也冲塌了，翠翠去找爷爷却发现老人已在雷声将息时死去了……
        老军人杨马兵热心地前来陪伴翠翠，也以渡船为生等待着傩送的归来
      </p>
      <p>
        《边城》成书于1934年4月，那正是沈从文爱情事业双丰收的季节。1931年社会虽然动荡不安，但总体上还是稍显和平，这个时候中国有良知的文人，都在思考着人性的本质，沈从文自然是走在前沿的，于是，他希望通过自己对湘西的印象，描写了一个近似于桃花源的湘西小城，给都市文明中迷茫的人性指一条明路。人间尚有纯洁自然的爱，人生需要皈依自然的本性。
        作品中女主人公翠翠的原型，是一个绒线铺的姑娘。沈从文在行军的途中，有一个叫赵开明的好友，在泸溪县城一家绒线铺遇到了一个叫翠翠的少女，她长得俊秀。赵开明发誓要娶她为妻。17年后，沈从文乘坐的小船又停靠在泸溪。他站在船头上，回忆到翠翠的美丽形象，便朝绒线铺走去，在门前意外地看到了一个和翠翠长得十分相似的少女，熟悉的眼睛、鼻子、薄薄的小嘴。沈从文惊讶得说不出话来。原来这是翠翠的女儿小翠。当年的翠翠嫁给了追求她的赵开明。这时她已死去，留下父女两个。为了不打扰赵开明，沈从文没有跟他打招呼，但感情上的震撼却久久不能平复。翠翠，这个美丽、朴实的少女，他怎么也无法忘怀。1934年，他坐在院子里，在阳光下的枣树和槐树枝叶阴影间写《边城》时，翠翠的形象便跃然纸上。沈从文在《湘行散记·老伴》中提到：“我写《边城》故事时，弄渡船的外孙女明慧温柔的品性，就从那绒线铺子女孩脱胎而来。
      </p>
      <p>
        翠翠是个天真善良、温柔清纯的小女孩，是作者倾注“爱”与“美”的理想的艺术形象。翠翠来到人间，便是爱的天使与爱的精灵。她爷爷把她领大，一老一少相依为命。她既是爱情的女儿，又是大自然的女儿。在她身上“天人合一”，她是美的精灵与化身。翠翠身上的“美”，是通过她的爱情故事逐步表现出来的：第一阶段：翠翠爱情萌生阶段。她在小镇看龙舟初遇傩送，爱情的种子就萌芽了。第二阶段：翠翠爱情的觉悟阶段。两年后又进城看龙舟，她的爱情意识已完全觉醒。
        第三阶段：翠翠对爱情执着的阶段。她在爱上傩送后，没想到傩送的哥哥也爱上了她。出于对爱情的忠贞，她明确向爷爷表示拒绝。然而，她与傩送的爱情却忽然受到严重挫折，傩送远走他乡、爷爷也死了使她一夜之间“长成大人”。最后，她像爷爷那样守住摆渡的岗位，苦恋并等待着傩送的归来，这些充分表现了翠翠性格坚强的一面
      </p>
      <p>
        爷爷保有着中国传统的美德，他对孙女翠翠亲情无限。为翠翠的亲事操心担忧，尽力促成翠翠爱情的实现。在生活上，对翠翠也是无比关怀，不让翠翠坐热石头，惟恐翠翠生病；在感情上尽力体谅翠翠的心思，翠翠忧伤寂寞时为她讲故事、说笑话、唱歌。他也是淳朴厚道却也倔强的老人，他为翠翠美丽而自信骄傲，为了翠翠嫁一个好人家，他不计地位的贫寒低贱，内心凄苦忧虑与责任自信交错
      </p>
      <p>
        天保个性豪爽、慷慨。他是船总的大儿子，却爱上了贫苦摆渡人的孙女。他知道弟弟也爱翠翠，两人唱歌“决斗”，他却因为自己先提了亲，“作哥哥的走车路占了先”，一定要弟弟先唱；弟弟“一开口”，他知道自己不是“敌手”，就很大度地成全了弟弟，充分表现了他的手足之情。后来他外出闯滩，既是为了弟弟的幸福，也是为了消解自己心中的失望和难过，“好忘却了上面的一切”。最后意外遇难，可以说他是为了亲情和爱情而死。
      </p>
      <p>
        傩送有着他母亲的美好品格，细腻。傩送孤独地追求着爱情，和哥哥的“决斗”，夜半唱情歌，却并不为心上人所知。最后也孤独地出走，不知飘泊到什么地方
      </p>
      <p>
        前清解甲流落军官“顺顺”凭着一些积蓄经营木船，事业兴旺发达，又因大方洒脱，仗义慷慨，诚信公道，被众举为“掌水码头”一方豪杰绅士
      </p>
      <p>
        主题思想
        《边城》寄托着沈从文“美”与“爱”的美学理想，是他的作品中最能表现人性美的一部小说。《边城》极力讴歌的传统文化中保留至今的美德，是相对于现代社会传统美德受到破坏，到处充溢着物欲金钱主义的浅薄、庸俗和腐化堕落的现实而言的。《边城》描写的湘西，自然风光秀丽、民风纯朴，人们不讲等级，不谈功利，人与人之间真诚相待，相互友爱。外公对孙女的爱、翠翠对傩送纯真的爱、天保兄弟对翠翠真挚的爱以及兄弟间诚挚的手足之爱，这些都代表着未受污染的农业文明的传统美德。作者极力状写湘西自然之明净，也是为了状写湘西人的心灵之明净。《边城》写以歌求婚、兄弟让婚、外公和翠翠相依之情，这些湘西人生命的形态和人生的方式，都隐含着对现实生活中古老的美德、价值观失落的痛心，以及对现代文明物欲泛滥的批判。作者推崇湘西人的人生方式，也想以此重建民族的品德和人格
      </p>
      <p>
        艺术特色
        《边城》采用了兼具抒情诗和小品文的优美笔触描绘了湘西特有风土民情。主要表现在以下两个方面：
        一是细腻的心理描写。心理描写是对人物在特定环境中的意志、愿望和思想感情等内心活动的描绘。或展开人物的美好心灵，或揭露人物的丑恶灵魂，以表现人物的精神状态和性格特征。其方法多种多样：或通过对话、独白、行动、姿态、面部表情等直接剖析；或采用幻想、梦境间接揭示；或借助景物描写、气氛渲染及周围人物的反映等侧面烘托。本文有两种方式：一是通过人物的幻想、梦境来披露人物心理。翠翠离奇的“胡思乱想”，让人感到渐渐有了自己心理的少女的孤单寂寞，以及爱情的幼芽时心灵的躁动；翠翠“顶美顶甜”的梦境，展示出对朦胧爱情的甜蜜感受和潜意识里对爱情的向往。二是通过人物在特定环境下的语言、神态的描写，形成强烈的暗示，诱使读者从人物的语言、神态上去体味人物的内心奥秘。翠翠“带着娇，有点儿埋怨”地一再央求爷爷丢下渡船上的活回到她身边，让人感受到翠翠对爷爷的无比依恋之情。听着爷爷唱的“那晚上听来的歌”，“翠翠自言自语说：‘我又摘了一把虎耳草了’”则让人感受到情窦初开的翠翠对甜美爱情的神往。
      </p>
      <div class="wu-xing" :class="{ showWuxing: scrollTop < 100 }">
        <el-input
          type="text"
          v-model.trim="readme"
          placeholder="请输入读后感"
        ></el-input>
        <div style="color:red;">
          {{ "★★★★★☆☆☆☆☆".slice(5 - rate, 10 - rate) }}
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "Tab2",
  components: {},
  data() {
    return {
      scrollTop: 0,
      readme: undefined,
      rate: 3
    };
  },
  computed: {},
  watch: {},
  methods: {
    handleScroll() {
      this.scrollTop = this.$refs["tab2-content"].scrollTop;
    }
  },
  created() {},
  mounted() {
    this.$refs["tab2-content"].addEventListener("scroll", this.handleScroll); // 监听div的滚动事件，然后用handleScroll这个方法进行相应的处理
  },
  destroyed() {
    window.removeEventListener("scroll", this.handleScroll, true);
  }
};
</script>
<style lang="scss" scoped>
.tab2 {
  h2 {
    width: 100%;
    text-align: center;
  }
  .tab2-content {
    border-radius: 10px;
    padding: 10px;
    position: relative;
    height: 485px;
    overflow-y: auto;
    border: 1px solid #ccc;
  }
  .wu-xing {
    position: fixed;
    right: 70px;
    bottom: 300px;
    width: 300px;
    height: 100px;
    border-radius: 10px;
    padding: 10px;
    border: 1px solid #ccc;
    background: rgb(214, 180, 180);
  }
  .showWuxing {
    display: none;
  }
}
</style>
